request_data/correct_request.xml

<?xml version='1.0' encoding='utf-8'?>
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/"><soap-env:Header xmlns:wsa="http://www.w3.org/2005/08/addressing"><wsa:Action>http://tempuri.org/IInventoryService/GetAllPortsFiltered</wsa:Action><wsa:MessageID>urn:uuid:260593cf-48cc-4ab5-8568-b0577502d380</wsa:MessageID><wsa:To>http://ims.surfnet.nl:8095/Inventory/iInventoryHttp</wsa:To></soap-env:Header><soap-env:Body><ns0:GetAllPortsFiltered xmlns:ns0="http://tempuri.org/"><ns0:pager><ns1:Descending xmlns:ns1="http://schemas.datacontract.org/2004/07/PresentationModel.DatabaseFilter">false</ns1:Descending><ns2:NumberOfElements xmlns:ns2="http://schemas.datacontract.org/2004/07/PresentationModel.DatabaseFilter">2</ns2:NumberOfElements><ns3:StartElement xmlns:ns3="http://schemas.datacontract.org/2004/07/PresentationModel.DatabaseFilter">0</ns3:StartElement></ns0:pager><ns0:filter><ns4:Filters xmlns:ns4="http://schemas.datacontract.org/2004/07/PresentationModel.DatabaseFilter"><ns4:FilterField><ns4:Name>CircuitId</ns4:Name><ns4:SelectedOperator>OperationEquals</ns4:SelectedOperator><ns4:Value>1</ns4:Value></ns4:FilterField></ns4:Filters></ns0:filter><ns0:sessionToken>ab46dc41-a180-454f-93f2-addaaaa9c989</ns0:sessionToken></ns0:GetAllPortsFiltered></soap-env:Body></soap-env:Envelope>